
/* Intrinsic meaning: General heading level 1 */
"heading1" = "Heading 1";

/* Intrinsic meaning: General heading level 2 */
"heading2" = "Heading 2";

/* Intrinsic meaning: General heading level 3 */
"heading3" = "Heading 3";

/* Intrinsic meaning: General heading level 4 */
"heading4" = "Heading 4";

/* Intrinsic meaning: General heading level 5 */
"heading5" = "Heading 5";

/* Intrinsic meaning: General heading level 6 */
"heading6" = "Heading 6";

/* Intrinsic meaning: Filename */
"filename" = "Filename";


/* Intrinsic meaning: Enumeration with numbers */
"orderedList" = "Ordered List";

/* Intrinsic meaning: Enumeration with bullets */
"unorderedList" = "Unordered List";

/* Intrinsic meaning: Block quote */
"blockquote" = "Block Quote";

/* Intrinsic meaning: Code block */
"codeblock" = "Code Block";

/* Intrinsic meaning: Block of native contents */
"nativeblock" = "Raw Source Block";

/* Intrinsic meaning: Comment */
"comment" = "Comment Block";

/* Intrinsic meaning: Divider (visual horizontal line) */
"divider" = "Divider";

	
/* Intrinsic meaning: Code block / inline code */
"code" = "Code";

/* Intrinsic meaning: Native contents  */
"inlineNative" = "Raw Source";

/* Intrinsic meaning: some marker */
"mark" = "Marked";

/* Intrinsic meaning: "Strong" marker */
"strong" = "Strong";

/* Intrinsic meaning: "Emphasis" marker */
"emph" = "Emphasis";

/* Intrinsic meaning: "Citation" marker */
"cite" = "Citation";

/* Intrinsic meaning: "To be deleted" marker */
"delete" = "Delete";

/* Intrinsic meaning: "Inline Comment" marker */
"inlineComment" = "Comment";


/* Intrinsic meaning: Hyperlink */
"link" = "Link";

/* Intrinsic meaning: Text Annotation */
"annotation" = "Annotation";


/* Intrinsic meaning: Footnote */
"footnote" = "Footnote";

/* Intrinsic meaning: Footnote -- short abbreviated string displayed in text */
"footnote_short" = "FN";

/* Intrinsic meaning: Reference (like bibliography, Index, etc) */
"reference" = "Reference";

/* Intrinsic meaning: Reference (like bibliography, Index, etc) -- short abbreviated string displayed in text */
"reference_short" = "REF";

/* Intrinsic meaning: Image embedded in text */
"image" = "Image";

/* Intrinsic meaning: Image embedded in text -- short abbreviated string displayed in text */
"image_short" = "IMG";

/* Intrinsic meaning: Video embedded in text */
"video" = "Video";

/* Intrinsic meaning: Video embedded in text -- short abbreviated string displayed in text */
"video_short" = "VID";
